In [45]:
import pandas as pd
import numpy as np

In [46]:
d1 = pd.DataFrame({'key': ['a','b','c'],
                  'num1': range(3)})
d2 = pd.DataFrame({'key': ['b', 'f'],
                  'num2': range(2)})

In [47]:
d1

  key  num1
0   a     0
1   b     1
2   c     2

In [48]:
d2

  key  num2
0   b     0
1   f     1

In [49]:
pd.merge(d1,d2, on='key')

  key  num1  num2
0   b     1     0

In [50]:
#Merge operations on different columns

In [63]:
d3 = pd.DataFrame({'key1': ['a','b','c','c','d','e'],
                   'num1': range(6),
                  })

In [64]:
d4 = pd.DataFrame({'key2': ['b','c','e','f'],
                   'num2': range(4),
                  })

In [65]:
print(d3)
print(d4)

  key1  num1
0    a     0
1    b     1
2    c     2
3    c     3
4    d     4
5    e     5
  key2  num2
0    b     0
1    c     1
2    e     2
3    f     3

In [66]:
#pd.merge(d3,d4, left_on = 'key1', right_on = 'key2')

In [71]:
# Outer Join

pd.merge(d3,d4, right_index = True, left_index = True, how = 'outer')

  key1  num1 key2  num2
0    a     0    b   0.0
1    b     1    c   1.0
2    c     2    e   2.0
3    c     3    f   3.0
4    d     4  NaN   NaN
5    e     5  NaN   NaN

In [73]:
# Left Join Merge

pd.merge(d1, d2, how ='left')

  key  num1  num2
0   a     0   NaN
1   b     1   0.0
2   c     2   NaN

In [76]:
# Right Join Merge

pd.merge(d1, d2, how = 'right')

  key  num1  num2
0   b   1.0     0
1   f   NaN     1

In [77]:
# Inner Join Merge

pd.merge(d1, d2, how = 'inner')

  key  num1  num2
0   b     1     0

In [78]:
# In confusion, refer to your diary.

In [79]:
# FOR THE NEXT PART:

In [104]:
d5 = pd.DataFrame([[1,2], [3,4], [5,6]],
                     index = ['a', 'c', 'd'],
                     columns = ['Prajwal', 'Rakesh']
                    )
d6 = pd.DataFrame([[7,8], [9,10], [11,12], [13,14]],
                    index = ['a', 'b', 'e', 'f'],
                    columns = ['Aakash', 'Ritesh']
                   )

In [105]:
d5

   Prajwal  Rakesh
a        1       2
c        3       4
d        5       6

In [106]:
d6

   Aakash  Ritesh
a       7       8
b       9      10
e      11      12
f      13      14

In [107]:
# Merging with different columns: Outer Join Merge

pd.merge(d5, d6, left_index = True, right_index = True, how = 'outer')

   Prajwal  Rakesh  Aakash  Ritesh
a      1.0     2.0     7.0     8.0
b      NaN     NaN     9.0    10.0
c      3.0     4.0     NaN     NaN
d      5.0     6.0     NaN     NaN
e      NaN     NaN    11.0    12.0
f      NaN     NaN    13.0    14.0

In [108]:
# Merge using index values
d5.join(d6)

   Prajwal  Rakesh  Aakash  Ritesh
a        1       2     7.0     8.0
c        3       4     NaN     NaN
d        5       6     NaN     NaN

In [109]:
d6.join(d5)

   Aakash  Ritesh  Prajwal  Rakesh
a       7       8      1.0     2.0
b       9      10      NaN     NaN
e      11      12      NaN     NaN
f      13      14      NaN     NaN

In [110]:
d5.join(d6, how = 'outer')

   Prajwal  Rakesh  Aakash  Ritesh
a      1.0     2.0     7.0     8.0
b      NaN     NaN     9.0    10.0
c      3.0     4.0     NaN     NaN
d      5.0     6.0     NaN     NaN
e      NaN     NaN    11.0    12.0
f      NaN     NaN    13.0    14.0

In [111]:
# TASK of the day

In [114]:
data = pd.DataFrame([[1,5], [2, 8], [12, 25]], index = ['a', 'b', 'f'], columns = ['Narayan', 'Nirajan'])

In [115]:
data

   Narayan  Nirajan
a        1        5
b        2        8
f       12       25

In [116]:
d5.join([d6, data])

   Prajwal  Rakesh  Aakash  Ritesh  Narayan  Nirajan
a      1.0     2.0     7.0     8.0      1.0      5.0
c      3.0     4.0     NaN     NaN      NaN      NaN
d      5.0     6.0     NaN     NaN      NaN      NaN

In [117]:
# Concatenation with Numpy

In [118]:
seq = np.arange(20).reshape(4,5)

In [119]:
np.concatenate([seq, seq])

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [120]:
np.concatenate([seq, seq], axis = 1)

array([[ 0,  1,  2,  3,  4,  0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19, 15, 16, 17, 18, 19]])

In [121]:
# Concatenation with Pandas

In [123]:
data1 = pd.Series([0,1], index = ['a', 'b'])
data2 = pd.Series([2,3,4], index = ['c', 'd', 'e'])
data3 = pd.Series([5,6], index = ['f', 'g'])

In [124]:
pd.concat([data1, data2, data3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [125]:
pd.concat([data1, data2, data3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [126]:
data4 = pd.Series([10,11,12], index = ['a', 'b', 'c'])

In [127]:
pd.concat([data1, data4], axis = 1, join = 'inner')

   0   1
a  0  10
b  1  11

In [128]:
x = pd.concat([data1, data2, data4], keys = ['one', 'two', 'three'])

In [129]:
x

one    a     0
       b     1
two    c     2
       d     3
       e     4
three  a    10
       b    11
       c    12
dtype: int64